import React, { Component } from 'react';
import ReactToPrint from 'react-to-print';

 class ComponentToPrint extends Component {
    render() {
        
        return (
            <div className="container mt-3" style={{color:"black", background:"white",paddingTop:"10px"}}>
                <div className="col-md-10 mx-auto mt-5" align="center" >
                    <h2>ශ්‍රී ලංකා ජාතික රුධිර පාරවිලයන සේවය​
     රුධිර දායක ප්‍රකාශය හා වාර්තාව​</h2>
                <hr style={{border: "3px solid black"}}></hr>
                </div>
                <br/>
                <div className="col-md-12 mx-auto" align="left" >
                <h3>රුධිර පරිත්‍යාගශීලී හිතවත​,</h3>
                <p style={{fontSize:"20px"}}>ලේ දන් දෙන ඔබේත් , ඔබේ ලේ ලබා ගන්නා රෝගීන් ගේත්, ආරක්‍ෂාව තහවුරු කිරීම සඳහා කරුණාකර මෙම විස්තර 
                පත්‍රිකාව නිවැරැදි ව​, <span style={{color:"red"}}>තනිවම</span> පුරවන්න​.පත්‍රිකාව පිරවීමට පෙර , මුල් පිටුවෙහි සඳහන් "රුධිර දායක උපදෙස් මාලාව​" 
                හොඳින් කියවා තේරුම් ගන්න​. 
                ඒ සම්බන්ධයෙන් ගැටලුවක් ඇත්නම් කරුණාකර ජාතික රුධිර පාරවිලයන සේවයේ කාර්‍ය මණ්ඩලයෙන් විමසන්න​.</p>
                <table style={{fontSize:"20px",color:"black"}} align="center">
                
                    <tbody>
                    <tr>
                        <td>01 <br/>අ) ඔබ මීට පෙර ලේ දන් දී තිබේද​?	</td>
                        <td> </td>
                        <td></td>
                    </tr>
                    
                    <tr>
                        <td>ආ) එසේ නම් කී වරක්ද​? </td>
                        <td> </td>
                        <td></td>
                    </tr>
                    <tr>
                        <td>ඇ) අවසන් වරට ලේ දුන් දිනය​</td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>ඈ) කලින් ලේ දුන් අවස්ථාවල ඔබට යම් අපහසුවක් වී තිබේද​?</td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>ඉ) අපහසුවක් වී නම් එය සඳහන් කරන්න</td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>ඊ) ලේ නොදෙන ලෙසට කෙදිනක හෝ ඔබට වෛද්‍ය උපදෙස් ලැබී තිබේද​?</td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>උ) ඔබ අද දින ලැබුණු "රුධිර දායක උපදෙස් පත්‍රිකාව​" කියවා හොඳින් තේරුම් ගත්තෙහිද​?	</td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <br/>
                    <tr>
                        <td>02 <br/>අ) ඔබ දැනට හොඳ සෞඛය තත්ත්වයෙන් පසු වන්නේද​?	</td>
                        <td> </td>
                        <td></td>
                    </tr>
                    
                    <tr>
                        <td>ආ) ඔබට පහත දැක්වෙන කවර හෝ රෝගී තත්ත්වයක් වැළඳී හෝ ඒ සඳහා ප්‍රතිකාර ගෙන 
                                තිබේද​?එසේ නම් අදාළ රෝගය ඉදිරියෙන් x ලකුණ යොදන්න​. <br/>
                                <div>හෘද රෝග &emsp;&emsp;&emsp;&emsp; දියවැඩියාව &emsp;&emsp;&emsp;&emsp; වලිප්පුව<br/>
                                ​අංශභාගය​ &emsp;&emsp;&emsp;&emsp; ඇදුම​/පෙනහළු රෝග &emsp;&emsp;&emsp;&emsp; අක්මා රෝග​<br/>
                                වකුගඩු රෝගය &emsp;&emsp;&emsp;&emsp; රුධිර රෝග &emsp;&emsp;&emsp;&emsp; පිළිකා<br/>
                                </div>
                        </td>
                        <td> </td>
                        <td></td>
                    </tr>
                    <tr>
                        <td>ඇ) ඔබ දැනට කවර හෝ ඹෟෂධයක්/ප්‍රතිකාරයක් ලබාගන්නේද​?	​</td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>ඈ) ඔබ ශල්‍ය කර්මයකට භාජනය වී තිබේද​?	</td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>ඉ) ලේ දීමෙන් පසු අද දින ඔබට බර වැඩවල යෙදීමට හෝ මගී ප්‍රවාහන වාහන පැදවීම,
                    උස් ගොඩනැගිලි මත වැඩ කිරීම , කඳු නැගීම , විශාල යන්ත්‍රෝපකරණ ක්‍රියා කරවීම වැනි දේවල යෙදීමට සිදුව තිබේද​?

                        </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>ඊ) ඔබ දැනට ගර්භණීව සිටීද​? මව් කිරි දීමෙහි යෙදෙන්නේද​? පසුගිය මාස 12 තුළ දරු 
                            ප්‍රසූතියකට හෝ ගබ්සා වීමකට ලක් වූයේද​?
                        </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    
                    <br/><br/>
                    
                    <tr>
                        <td>03 <br/>අ) කෙදිනක හෝ ඔබට කහ උණ/සෙංගමාලය(Hepatitis) රෝගය වැළඳි තිබේද​?	</td>
                        <td> </td>
                        <td></td>
                    </tr>
                    <tr>
                        <td>ආ) පසුගිය වසර 2 තුළ -ක්‍ෂය රෝගය හෝ උණ සන්නිපාතය වැළඳී තිබේද​?
                                ඊට ප්‍රතිකාර ගෙන තිබේද​?

                        </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <br/>
                    <tr>
                        <td>04 පසුගිය මාස 12 තුළ,<br/>අ)ඔබ ප්‍රතිශක්තීකරණ හෝ වෙනත් එන්නතක් ලබා ගෙන තිබේද​?</td>
                        <td> </td>
                        <td></td>
                    </tr>
                    <tr>
                        <td>ආ)කන් විදීමක්,පච්චා කෙටීමක් හෝ කටු චිකිත්සා ප්‍රතිකාරයක් සිදු කර තිබේද​?
                        </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>ඇ)බන්ධනාගාරගත වී තිබේද​?
                        </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>ඈ)ඔබ හෝ ඔබගේ සහකරු /සහකාරිය විදේශගත වී තිබේද​?
                        </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>ඉ)ඔබට හෝ ඔබගේ සහකරු/සහකාරියට රුධිරය හෝ රුධිර කොටස් ලබා දී තිබේද​?
                        </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>ඊ)ඔබට මැලේරියාව වැළඳී හෝ ඊට ප්‍රතිකාර ගෙන තිබේද​?
                        </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <br/>
                    <tr>
                        <td>05<br/>අ) පසුගිය මාස 6 තුළ ඔබට ඩෙංගු වැළඳී හෝ ඊට ප්‍රතිකාර ගෙන තිබේද​?</td>
                        <td> </td>
                        <td></td>
                    </tr>
                    <tr>
                        <td>ආ)පසුගිය මාසය තුළ -පැපොළ​,සරම්ප​,කම්මුල්ගාය,රුබෙල්ලා උණ (ජර්මන් සරම්ප​) 
                            පාචනය හෝ වෙනත් කල් පවත්නා (සතියකට වැඩි) උණකින් පෙළුනේද​?
                        </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>ඇ)පසුගිය සතිය තුළ - ඔබේ දත් ගැලවීමක් සිදු කර තිබේද​?
                        </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>ඈ)පසුගිය සතිය තුළ - ඔබ ප්‍රතිජීවක(Antibiotics) හෝ ඇස්ප්‍රීන්(Aspirin) හෝ(වෙනත්) ඖෂධ කිසිවක් භාවිතා කළේද​?
                        </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <br/>
                    <tr>
                        <td>06<br/>අ)පහත දැක්වෙන කවර හෝ කාණ්ඩයකට ඔබ අයත් වේ නම් ලේ දන් දීම සුදුසු නොවන බව දන්නෙහිද​?</td>
                        <td> </td>
                        <td></td>
                    </tr>
                    <tr>
                        <td>
                        <ul>
                            <li>ඔබ ඒඩ්ස්(HIV/AIDS) හෝ සෙංගමාල(Hepatitis B/C) ආසාදනයට ලක් වූවකු නම්</li>
                            <li>ඔබේ ලිංගික සබඳතා එක් අයෙකුට සීමා වී නොමැති නම්</li>
                            <li>ඔබ වෙනත් පිරිමියකු සමග සමලිංගික ඇසුරක යෙදී ඇති පිරිමියකු නම්</li>
                            <li>ඔබ කෙදිනක හෝ මත් ද්‍රව්‍යයන් ශරීරයට එන්නත් කොට ගෙන තිබේ නම්</li>
                            <li>ඔබ කෙදිනක හෝ ගණිකා වෘත්තියෙහි යෙදී තිබේ නම්</li>
                            <li>ඔබ පසුගිය මාස 12 තුළ කෙදිනක හෝ ගණිකා ඇසුරක යෙදී තිබේ නම්</li>
                            <li>ඔබට හෝ ඔබේ සහකරු/සහකාරියට ඒඩ්ස්(HIV/AIDS) හෝ වෙනත් ලිංගික රෝග ආසාදනයක් තිබේදැයි සැකයක් ඇත්නම්,</li>
                        </ul>
                        </td>
                        <td> </td>
                        <td></td>
                    </tr>
                    <tr>
                        <td>ආ)ඔබ හෝ ඔබේ සහකරු/සහකාරිය ඉහත සඳහන් කවර හෝ කාණ්ඩයකට අයත් වේද​?
                        </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>ඇ)ඔබ සිරුරේ බර අඩු වීමකින්, කුද්දැටි (වසා ග්‍රන්ථි) ඉදිමීමකින් ,කල් පවත්නා උණකින් හෝ පාචනයෙන් පෙළේද​?
                        </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    
                    </tbody>
                </table>
                
                </div>
                <div className="col-md-10 mx-auto mt-5" align="center" >
                    <h2>කොරෝනා වෛරස වසන්ගත තත්ත්වය හමුවේ රුධිරයේ සහ
		රුධිර පරිත‍‍යාගශිලීන්ගේ සුරක්‍ෂිත බව තහවුරු කිරීමේ
				රුධිර දායක ප්‍රකාශය.</h2>
                <hr style={{border: "3px solid black"}}></hr>
                </div>
                <br/>
                <div className="col-md-12 mx-auto" align="left" >
                <h4>කරුණාකර නිවැරදි තොරතුරු දක්වන්න.</h4>
                <table style={{fontSize:"20px",color:"black"}} align="center">
                    <tbody>
                    <tr>
                        <td>1. පසුගිය මාසය ඇතුළත ඔබට උණ,කැස්ස,හුස්ම ගැනීමේ අපහසුතා වැනි රෝග ලක්‍ෂණවලින් පෙළුණේද?</td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    
                    <tr>
                        <td>2. මේ අවස්ථාවේ ඔබගේ නිවසේ උණ,කැස්ස,හුස්ම ගැනීමේ අපහසුතා සහිත පුද්ගලයෙකු වාසය කරන්නේද? </td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>3. පසුගිය මාසය ඇතුළත විදේශ ගත වූ කෙනෙකු නිවසේ වාසය කළේද?</td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>4. පසුගිය මාසය ඇතුළත ඔබට උණ,කැස්ස,හුස්ම ගැනීමේ අපහසුතා වැනි රෝග ලක්‍ෂණවලින් පෙළුණේද?</td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    <tr>
                        <td>5. පසුගිය මාස 3 ඇතුළත ඔබ විදේශගත වී තිබේද?</td>
                        <td> </td>
                        <td>නැත</td>
                    </tr>
                    </tbody>
                </table>
                
                </div>
                <div className="col-md-10 mx-auto mt-5" align="center" >
                <table style={{fontSize:"20px",color:"black"}}>
                    <tr>
                        <td>සම්පූර්ණ නම​: </td>
                        <td></td>
                        <td>පුරුෂ / ස්ත්‍රී </td>
                        <td></td>
                    </tr>
                    <tr>
                        <td>ජාතික හැඳුනුම්පත් අංකය: </td>
                        <td></td>
                        <td>උපන් දිනය​:  </td>
                        <td></td>
                        <td>වයස​:</td>
                        <td></td>
                    </tr>
                    <tr>
                        <td>නිවසේ ලිපිනය(ස්ථීර/තාවකාලික​): </td>
                        <td></td>
                    </tr>
                    <tr>
                        <td>විද්‍යුත් තැපෑල:  </td>
                        <td></td>
                        <td>රුධිර වර්ගය​:</td>
                        <td></td>
                    </tr>
                    <tr>
                        <td>දුරකථන අංක  </td>
                        <td></td>
                    </tr>
                    </table>
                    <br></br>
                    <table  style={{fontSize:"20px",color:"black"}} className="mt-5">
                    <h2>රුධිර දායකයාගේ ප්‍රකාශය​</h2>
                    <tr>
                        <td>
                            <ul>
                                <li>කිසිඳු පුද්ගලික ලාභයක් අපේක්‍ෂාවෙන් තොරව​,ස්වේච්ඡාවෙන් අද දින මා පරිත්‍යාග කරන 
                                    රුධිරය අසරණ රෝගීන්ගේ යහපත වෙනුවෙන් ශ්‍රී ලංකා ජාතික රුධිර පාරවිලයන සේවයට 
                                    අවශ්‍ය අයුරින් යොදා ගැනීමට එකඟතාවය පළ කරමි.</li>
                                <li>
                                ලේ දන්දීමේදී මෙන්ම ඉන් පසුවත් ඒ පිළිබඳ ජාතික රුධිර පාරවිලයන
                                 සේවයේ උපදෙස් අනුව ක්‍රියා කරන අතර එසේ නොකිරීමෙන් සිදු විය හැකි හානි පිළිබඳ වගකීම මම බාර ගනිමි.
                                </li>
                                <li>
                                තවද මා පරිත්‍යාග කරන රුධිරය ඒඩ්ස්(HIV/AIDS),හෙපටයිටිස් බී සහ සී(Hepatitis B & C) ,උපදංශය(Syphilis) 
                                ,මැලේරියාව(Malaria) යන රෝග ආසාදනයන් සඳහා හෝ ජා.රු.පා. සේවයට අවශ්‍ය වෙනත් පරීක්‍ෂණයක් සඳහා 
                                පරීක්‍ෂාවට ලක් කිරීමට මාගේ එකඟතාවය පළකරමි.
                                </li>
                                <li>
                                එසේම ඉහත පරීක්‍ෂණවල ප්‍රතිඵල ජාතික රුධිර පාරවිලයන සේවයට අවශ්‍ය අවස්ථාවල දී මා වෙත දන්වනු ලැබීමටත්, 
                                එවන් අවස්ථාවලදී ජාතික රුධිර පාරවිලයන සේවය මගින් දෙනු ලබන වැඩි දුර උපදෙස් අනුව ක්‍රියා කිරීමටත් මාගේ කැමැත්ත 
                                හා එකඟතාව පළ කරමි.
                                </li>
                                <li>
                                මෙම පත්‍රිකාව කියවා හොඳින් වටහා ගත් අතර ඉහත ප්‍රශ්නවලට මා විසින් සපයන ලද පිළිතුරු වල සත්‍යතාවය ගැන අවංකව සහතික වෙමි.
                                </li>
                                <li>
                                දණ්ඩ නීති සංග්‍රහයේ 262,263 වගන්ති අනුව දැනුවත්ව රෝගයක් පැතිරවීමට කටයුතු කිරීම දඬුවම් ලැබිය හැකි වරදක් බව පිළිගනිමි.
                                </li>
                            </ul>
                        </td>
                    </tr>
                    
                    <tr>
                        <td>
                        යාවජීව / නිරන්තර රුධිර දායකයකු වශයෙන් අසරණ රෝගීන් වෙනුවෙන් ඉදිරියටත් රුධිරය පරිත්‍යාග කිරීමට කැමැත්තෙමි.
                        </td>
                    </tr>
                    </table>
                    <table  style={{fontSize:"20px",color:"black"}}>
                    <tr>
                        <td>මාස 4 කට වරක්</td>
                    </tr>
                    <tr>
                        <td>රුධිර දායකයාගේ නම</td>
                        <td>අත්සන</td>
                        <td>දිනය</td>
                    </tr>
                </table>
                </div>
            
        </div>
        )
      }
}

class Example extends Component {
    render() {
       
          
      return (
        <div className="container mt-5">
            <div className="col-md-12 mx-auto mt-5" align="right" >
          <ReactToPrint 
            trigger={() => <a  className="btn btn-success mt-5">Print this out!</a>}
            pageStyle="@page { size: auto; margin: 0mm; } @media print { body { -webkit-print-color-adjust: exact; padding: 100px;  !important; } td{padding-bottom:20px;}} "
            content={() => this.componentRef}
          />
          <ComponentToPrint ref={el => (this.componentRef = el)} />
          </div>
        </div>
      )
    }
  }
  
  export default Example;
  


